{"config": {"name": "sequential_1", "layers": [{"config": {"dtype": "float32", "kernel_regularizer": null, "name": "conv2d_1", "kernel_size": [3, 3], "filters": 128, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "batch_input_shape": [null, 32, 32, 3], "strides": [1, 1], "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "name": "conv2d_2", "kernel_size": [3, 3], "filters": 256, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [3, 3], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_regularizer": null, "name": "conv2d_3", "kernel_size": [3, 3], "filters": 128, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "name": "conv2d_4", "kernel_size": [3, 3], "filters": 64, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [3, 3], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "name": "dense_1", "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_2", "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}